package com.sqq.test.java_7;

/**
 * @author sqq
 * @Date 2021/6/7
 */
public class StrTest {

    public static void main(String[] args) {

        String s = "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "【后台】管理测试地址：https://t-rulearmylaw.aegis-info.com/\n" +
                "\n" +
                "账号adminUser&nbsp;密码：123456，\n" +
                "\n" +
                "武佃梅=》用户管理，问卷调查，&nbsp;\n" +
                "\n" +
                "吴姝涵=》兜底回复设置，日志记录，敏感词预警，反馈管理，机器人管理，门户网模块配置，首页大图，专题配置，军事案例，裁判文书\n" +
                "\n" +
                "袁毅伟=》门户网后管-自定义菜单，专题管理，军法新闻，重大课题，媒体宣传，军法文献，外军研究，著作论文，军法艺苑\n" +
                "\n" +
                "刘沣锐=》门户网管理首页文案配置，友情链接&nbsp;&nbsp;\n" +
                "\n" +
                "\n" +
                "【前台】依法治军门户网测试地址：https://t-rulearmylaw-web.aegis-info.com/&nbsp;&nbsp;\n" +
                "\n" +
                "武佃梅=》首页，登录，综合搜索，法律法规检索，问卷调查，机器人咨询\n" +
                "\n" +
                "吴姝涵=》军法新闻，重大课题，媒体宣传，军法文献，外军研究，著作论文，军事案例，裁判文书，军法论坛，专题，个人中心（我的留言，分享留言，我的答复）\n" +
                "\n" +
                "刘沣锐=》军法艺苑，消息中心，个人中心编辑个人信息，个人中心我的收藏，我的互动。\n" +
                "\n" +
                "\n" +
                "后端人员：\n" +
                "\n" +
                "徐益庆：登录/注册/忘记密码/资料完善/退出、用户权限、万能答复配置、军事案例、裁判文书、法规案例、军法论坛、机器人状态配置、机器人页面配置、门户网案例检索\n" +
                "\n" +
                "宋奇奇：军法新闻、重大课题、媒体宣传、著作论文、军法文献、外军研究、军法艺苑、自定义菜单管理、模块配置、首页文案配置、首页大图、友情链接管理、专题配置\n" +
                "\n" +
                "卞显毛：日志记录、敏感词预警\n" +
                "\n" +
                "花蕾：问卷调查管理、敏感词预警\n" +
                "\n" +
                "陈超：前后台的留言反馈\n" +
                "\n" +
                "倪有发：人脸识别、法规案例库的数据处理和导入\n" +
                "\n" +
                "郑茂盛：管理后台-问答库管理、留言智能推荐、机器人智能咨询、视频、asr纠错、推荐问卷、指令\n" +
                "\n" +
                "祝濮文：门户网-法规检索";

        boolean contains = s.contains("依法治军");
        if(contains){
            String replace = s.replace("依法治军", "<em>" + "依法治军" + "</em>");
            System.out.println(replace);
        }

    }
}
